joe-speedboat/embedded.Arduino.LowPower/hardware/ProMiniLP/avr/boards.txt
menu.cpu=Processor

######################################
## Optiboot ProMini Low Power

ProMiniLP.name=ProMini LowPower

ProMiniLP.upload.tool=arduino:avrdude
ProMiniLP.upload.protocol=arduino
ProMiniLP.upload.maximum_size=30720
ProMiniLP.upload.maximum_data_size=2048

ProMiniLP.bootloader.tool=arduino:avrdude
ProMiniLP.bootloader.unlock_bits=0x3F
ProMiniLP.bootloader.lock_bits=0x0F

ProMiniLP.build.board=AVR_PRO
ProMiniLP.build.core=arduino:arduino
ProMiniLP.build.variant=prominilp
ProMiniLP.build.mcu=atmega328p

ProMiniLP.menu.cpu.1MhzIC_bodd=Atmega328 1Mhz (BOD disabled, internal Clock)
ProMiniLP.menu.cpu.1MhzIC_bodd.upload.speed=9600
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.low_fuses=0x62
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.high_fuses=0xD4
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1MhzIC_bodd.build.f_cpu=1000000L

ProMiniLP.menu.cpu.1MhzIC_18v=Atmega328 1Mhz (BOD 1.8V, internal Clock)
ProMiniLP.menu.cpu.1MhzIC_18v.upload.speed=9600
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.low_fuses=0x62
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.high_fuses=0xD4
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.extended_fuses=0x06
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1MhzIC_18v.build.f_cpu=1000000L

ProMiniLP.menu.cpu.1Mhz_bodd=Atmega328 1Mhz (BOD disabled, CKDIV8)
ProMiniLP.menu.cpu.1Mhz_bodd.upload.speed=9600
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.low_fuses=0x7F
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1Mhz_bodd.build.f_cpu=1000000L

ProMiniLP.menu.cpu.1Mhz_bodd=Atmega328 1Mhz (BOD 1.8V, CKDIV8)
ProMiniLP.menu.cpu.1Mhz_bodd.upload.speed=9600
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.low_fuses=0x7F
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1Mhz_bodd.build.f_cpu=1000000L

ProMiniLP.menu.cpu.8MHz_atmega328_18v=ATmega328 8MHz (BOD disabled)
ProMiniLP.menu.cpu.8MHz_atmega328_18v.upload.speed=57600
ProMiniLP.menu.cpu.8MHz_atmega328_18v.bootloader.low_fuses=0xFF
ProMiniLP.menu.cpu.8MHz_atmega328_18v.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.8MHz_atmega328_18v.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.8MHz_atmega328_18v.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_8MHz.hex
ProMiniLP.menu.cpu.8MHz_atmega328_18v.build.mcu=atmega328p
ProMiniLP.menu.cpu.8MHz_atmega328_18v.build.f_cpu=8000000L

ProMiniLP.menu.cpu.8MHz_atmega328bodd=ATmega328 8MHz (BOD 1.8V)
ProMiniLP.menu.cpu.8MHz_atmega328bodd.upload.speed=57600
ProMiniLP.menu.cpu.8MHz_atmega328bodd.bootloader.low_fuses=0xFF
ProMiniLP.menu.cpu.8MHz_atmega328bodd.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.8MHz_atmega328bodd.bootloader.extended_fuses=0x06
ProMiniLP.menu.cpu.8MHz_atmega328bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_8MHz.hex
ProMiniLP.menu.cpu.8MHz_atmega328bodd.build.mcu=atmega328p
ProMiniLP.menu.cpu.8MHz_atmega328bodd.build.f_cpu=8000000L

